# DeleteWorksetSettings Properties

---
The DeleteWorksetSettings type exposes the following members.
| Name| Description
---|---|---
| DeleteWorksetOption|  The current delete workset option.
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
| WorksetId|  The target worksetId for those elements under the deleted workset, which is used for DeleteWorksetOption::MoveElementsToWorkset.
Top
#### Reference
DeleteWorksetSettings Class
Autodesk.Revit.DB Namespace